# Задание. Выведите на экран текст Hello, World. I have startup!
print("Hello, World. I have startup!")