# Задание. По традиции самой превой программой, которая написана на языке программирования,
# является программа, выводящая на экран строку Hello, World!
# Напиши её, используя втроенную функцию print.
print("Hello, World!")